reddit_clone/app/controllers/subs_controller.rb

  def create
    if logged_in?
      @sub = Sub.new(sub_params)
      @sub.moderator_id = current_user.id
      if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sub1"], ["description", "sub."], ["moderator_id", 2], ["created_at", "2022-11-18 21:47:55.986854"], ["updated_at", "2022-11-18 21:47:55.986854"]]

  def show
    @sub = Sub.find_by(id: params[:id])
    @posts = Post.where(sub_id: @sub.id)
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]

  def update
    if logged_in?
      @sub = Sub.find_by(id: params[:id])
      if @sub.moderator_id == current_user.id
        if @sub.update(sub_params)
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "sub"], ["updated_at", "2022-11-18 22:05:25.264327"], ["id", 1]]