reddit_clone/app/views/subs/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <p><%= post.content %></p>
    <h3><%= User.find(post.author_id).username %></h3>